source /opt/synopsys/2016/primetime/admin/setup/.synopsys_pt.setup
###### Pre-Layout PrimeTime Script #######
lappend search_path ../dc_synth/output
source ../set_env.tcl
## read the verilog files
read_verilog fifo.v
## Set top module name
link_design FIFO
## Read in SDC from the synthesis
read_sdc ../dc_synth/const/fifo.sdc
## Analysis reports
## Save outputs
